; ModuleID = '/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite/test_cases_bc/mem_leak/malloc53.c.bc'
source_filename = "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite/src/mem_leak/malloc53.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.s_rr_node = type { i16, i16, i16, i16, i16, i16, i32, ptr, ptr, float, float }

@.str = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [25 x i8] c"Press ENTER to continue\0A\00", align 1, !dbg !12
@nx = dso_local global i32 0, align 4, !dbg !17
@ny = dso_local global i32 0, align 4, !dbg !39
@num_rr_nodes = dso_local global i32 0, align 4, !dbg !45
@rr_node = dso_local global ptr null, align 8, !dbg !47
@io_rat = dso_local global i32 0, align 4, !dbg !41
@pins_per_clb = dso_local global i32 0, align 4, !dbg !43

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @MUSTALIAS(ptr noundef %p, ptr noundef %q) #0 !dbg !74 {
entry:
  %p.addr = alloca ptr, align 8
  %q.addr = alloca ptr, align 8
  store ptr %p, ptr %p.addr, align 8
  call void @llvm.dbg.declare(metadata ptr %p.addr, metadata !78, metadata !DIExpression()), !dbg !79
  store ptr %q, ptr %q.addr, align 8
  call void @llvm.dbg.declare(metadata ptr %q.addr, metadata !80, metadata !DIExpression()), !dbg !81

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "aliascheck.h", directory: "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite", checksumkind: CSK_MD5, checksum: "1a872d554bb9ccba276f530467d4645b")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 2)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 4)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 25)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "nx", scope: !19, file: !23, line: 11, type: !35, isLocal: false, isDefinition: true)
!19 = distinct !DICompileUnit(language: DW_LANG_C11, file: !20, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !32, globals: !38, splitDebugInlining: false, nameTableKind: None)
!20 = !DIFile(filename: "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite/src/mem_leak/malloc53.c", directory: "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite", checksumkind: CSK_MD5, checksum: "5e854eca03ad663eed597f9fff19ad5b")
!21 = !{!22}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 10, baseType: !24, size: 32, elements: !25)
!23 = !DIFile(filename: "src/mem_leak/malloc53.c", directory: "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite", checksumkind: CSK_MD5, checksum: "5e854eca03ad663eed597f9fff19ad5b")
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !{!26, !27, !28, !29, !30, !31}
!26 = !DIEnumerator(name: "SOURCE", value: 0)
!27 = !DIEnumerator(name: "SINK", value: 1)
!28 = !DIEnumerator(name: "IPIN", value: 2)
!29 = !DIEnumerator(name: "OPIN", value: 3)
!30 = !DIEnumerator(name: "CHANX", value: 4)
!31 = !DIEnumerator(name: "CHANY", value: 5)
!32 = !{!33, !34, !36}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!38 = !{!0, !7, !12, !17, !39, !41, !43, !45, !47}
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "ny", scope: !19, file: !23, line: 11, type: !35, isLocal: false, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "io_rat", scope: !19, file: !23, line: 11, type: !35, isLocal: false, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "pins_per_clb", scope: !19, file: !23, line: 11, type: !35, isLocal: false, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "num_rr_nodes", scope: !19, file: !23, line: 12, type: !35, isLocal: false, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "rr_node", scope: !19, file: !23, line: 18, type: !49, isLocal: false, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_rr_node", file: !23, line: 14, size: 320, elements: !51)
!51 = !{!52, !54, !55, !56, !57, !58, !59, !61, !62, !64, !65}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !50, file: !23, line: 14, baseType: !53, size: 16)
!53 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !50, file: !23, line: 14, baseType: !53, size: 16, offset: 16)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ylow", scope: !50, file: !23, line: 14, baseType: !53, size: 16, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "yhigh", scope: !50, file: !23, line: 14, baseType: !53, size: 16, offset: 48)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptc_num", scope: !50, file: !23, line: 15, baseType: !53, size: 16, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "num_edges", scope: !50, file: !23, line: 15, baseType: !53, size: 16, offset: 80)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, file: !23, line: 15, baseType: !60, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_rr_type", file: !23, line: 10, baseType: !22)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !50, file: !23, line: 15, baseType: !34, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "switches", scope: !50, file: !23, line: 16, baseType: !63, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !50, file: !23, line: 16, baseType: !37, size: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !50, file: !23, line: 16, baseType: !37, size: 32, offset: 288)
!66 = !{i32 7, !"Dwarf Version", i32 5}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{i32 8, !"PIC Level", i32 2}
!70 = !{i32 7, !"PIE Level", i32 2}
!71 = !{i32 7, !"uwtable", i32 2}
!72 = !{i32 7, !"frame-pointer", i32 2}
!73 = !{!"clang version 16.0.0"}
!74 = distinct !DISubprogram(name: "MUSTALIAS", scope: !2, file: !2, line: 4, type: !75, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !77)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !33, !33}
!77 = !{}
!78 = !DILocalVariable(name: "p", arg: 1, scope: !74, file: !2, line: 4, type: !33)
!79 = !DILocation(line: 4, column: 22, scope: !74)
!80 = !DILocalVariable(name: "q", arg: 2, scope: !74, file: !2, line: 4, type: !33)
!81 = !DILocation(line: 4, column: 31, scope: !74)
!82 = !DILocation(line: 5, column: 3, scope: !74)
!83 = !DILocation(line: 6, column: 1, scope: !74)
!84 = distinct !DISubprogram(name: "PARTIALALIAS", scope: !2, file: !2, line: 8, type: !75, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !77)
!85 = !DILocalVariable(name: "p", arg: 1, scope: !84, file: !2, line: 8, type: !33)
!86 = !DILocation(line: 8, column: 25, scope: !84)
!87 = !DILocalVariable(name: "q", arg: 2, scope: !84, file: !2, line: 8, type: !33)
!88 = !DILocation(line: 8, column: 34, scope: !84)
!89 = !DILocation(line: 9, column: 3, scope: !84)
!90 = !DILocation(line: 10, column: 1, scope: !84)
!91 = distinct !DISubprogram(name: "MAYALIAS", scope: !2, file: !2, line: 12, type: !75, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !77)
!92 = !DILocalVariable(name: "p", arg: 1, scope: !91, file: !2, line: 12, type: !33)
!93 = !DILocation(line: 12, column: 21, scope: !91)
!94 = !DILocalVariable(name: "q", arg: 2, scope: !91, file: !2, line: 12, type: !33)
!95 = !DILocation(line: 12, column: 30, scope: !91)
!96 = !DILocation(line: 13, column: 3, scope: !91)
!97 = !DILocation(line: 14, column: 1, scope: !91)
!98 = distinct !DISubprogram(name: "NOALIAS", scope: !2, file: !2, line: 16, type: !75, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !77)
!99 = !DILocalVariable(name: "p", arg: 1, scope: !98, file: !2, line: 16, type: !33)
!100 = !DILocation(line: 16, column: 20, scope: !98)
!101 = !DILocalVariable(name: "q", arg: 2, scope: !98, file: !2, line: 16, type: !33)
!102 = !DILocation(line: 16, column: 29, scope: !98)
!103 = !DILocation(line: 17, column: 3, scope: !98)
!104 = !DILocation(line: 18, column: 1, scope: !98)
!105 = distinct !DISubprogram(name: "EXPECTEDFAIL_MAYALIAS", scope: !2, file: !2, line: 20, type: !75, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !77)
!106 = !DILocalVariable(name: "p", arg: 1, scope: !105, file: !2, line: 20, type: !33)
!107 = !DILocation(line: 20, column: 34, scope: !105)
!108 = !DILocalVariable(name: "q", arg: 2, scope: !105, file: !2, line: 20, type: !33)
!109 = !DILocation(line: 20, column: 43, scope: !105)
!110 = !DILocation(line: 21, column: 3, scope: !105)
!111 = !DILocation(line: 22, column: 1, scope: !105)
!112 = distinct !DISubprogram(name: "EXPECTEDFAIL_NOALIAS", scope: !2, file: !2, line: 24, type: !75, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !77)
!113 = !DILocalVariable(name: "p", arg: 1, scope: !112, file: !2, line: 24, type: !33)
!114 = !DILocation(line: 24, column: 33, scope: !112)
!115 = !DILocalVariable(name: "q", arg: 2, scope: !112, file: !2, line: 24, type: !33)
!116 = !DILocation(line: 24, column: 42, scope: !112)
!117 = !DILocation(line: 25, column: 3, scope: !112)
!118 = !DILocation(line: 26, column: 1, scope: !112)
