; ModuleID = '/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite/test_cases_bc/mem_leak/malloc9.c.bc'
source_filename = "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite/src/mem_leak/malloc9.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.s_rr_node = type { i16, i16, i16, i16, i16, i16, ptr, ptr, float, float }

@.str = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [25 x i8] c"Press ENTER to continue\0A\00", align 1, !dbg !12
@rr_node = dso_local global ptr null, align 8, !dbg !17

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @MUSTALIAS(ptr noundef %p, ptr noundef %q) #0 !dbg !51 {
entry:
  %p.addr = alloca ptr, align 8
  %q.addr = alloca ptr, align 8
  store ptr %p, ptr %p.addr, align 8
  call void @llvm.dbg.declare(metadata ptr %p.addr, metadata !55, metadata !DIExpression()), !dbg !56
  store ptr %q, ptr %q.addr, align 8
  call void @llvm.dbg.declare(metadata ptr %q.addr, metadata !57, metadata !DIExpression()), !dbg !58
  %call = call i32 (ptr, ...) @printf(ptr noundef @.str), !dbg !59
  ret void, !dbg !60
}

; Function Attrs: nocallback nofree nosync nounwind speculatable willreturn memory(none)
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "aliascheck.h", directory: "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite", checksumkind: CSK_MD5, checksum: "1a872d554bb9ccba276f530467d4645b")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 2)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 4)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 25)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "rr_node", scope: !19, file: !24, line: 17, type: !25, isLocal: false, isDefinition: true)
!19 = distinct !DICompileUnit(language: DW_LANG_C11, file: !20, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !21, globals: !23, splitDebugInlining: false, nameTableKind: None)
!20 = !DIFile(filename: "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite/src/mem_leak/malloc9.c", directory: "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite", checksumkind: CSK_MD5, checksum: "981416663f1672b55ed6f11d031495f4")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !{!0, !7, !12, !17}
!24 = !DIFile(filename: "src/mem_leak/malloc9.c", directory: "/g/data/ey69/xiao/project/Path-Sensitive-Analysis/Test-Suite", checksumkind: CSK_MD5, checksum: "981416663f1672b55ed6f11d031495f4")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_rr_node", file: !24, line: 10, size: 320, elements: !27)
!27 = !{!28, !30, !31, !32, !33, !34, !35, !38, !40, !42}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !26, file: !24, line: 11, baseType: !29, size: 16)
!29 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !26, file: !24, line: 11, baseType: !29, size: 16, offset: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ylow", scope: !26, file: !24, line: 11, baseType: !29, size: 16, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "yhigh", scope: !26, file: !24, line: 11, baseType: !29, size: 16, offset: 48)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptc_num", scope: !26, file: !24, line: 12, baseType: !29, size: 16, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "num_edges", scope: !26, file: !24, line: 12, baseType: !29, size: 16, offset: 80)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !26, file: !24, line: 13, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "switches", scope: !26, file: !24, line: 14, baseType: !39, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !26, file: !24, line: 14, baseType: !41, size: 32, offset: 256)
!41 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !26, file: !24, line: 14, baseType: !41, size: 32, offset: 288)
!43 = !{i32 7, !"Dwarf Version", i32 5}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{i32 1, !"wchar_size", i32 4}
!46 = !{i32 8, !"PIC Level", i32 2}
!47 = !{i32 7, !"PIE Level", i32 2}
!48 = !{i32 7, !"uwtable", i32 2}
!49 = !{i32 7, !"frame-pointer", i32 2}
!50 = !{!"clang version 16.0.0"}
!51 = distinct !DISubprogram(name: "MUSTALIAS", scope: !2, file: !2, line: 4, type: !52, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !54)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !22, !22}
!54 = !{}
!55 = !DILocalVariable(name: "p", arg: 1, scope: !51, file: !2, line: 4, type: !22)
!56 = !DILocation(line: 4, column: 22, scope: !51)
!57 = !DILocalVariable(name: "q", arg: 2, scope: !51, file: !2, line: 4, type: !22)
!58 = !DILocation(line: 4, column: 31, scope: !51)
!59 = !DILocation(line: 5, column: 3, scope: !51)
!60 = !DILocation(line: 6, column: 1, scope: !51)
!61 = distinct !DISubprogram(name: "PARTIALALIAS", scope: !2, file: !2, line: 8, type: !52, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !54)
!62 = !DILocalVariable(name: "p", arg: 1, scope: !61, file: !2, line: 8, type: !22)
!63 = !DILocation(line: 8, column: 25, scope: !61)
!64 = !DILocalVariable(name: "q", arg: 2, scope: !61, file: !2, line: 8, type: !22)
!65 = !DILocation(line: 8, column: 34, scope: !61)
!66 = !DILocation(line: 9, column: 3, scope: !61)
!67 = !DILocation(line: 10, column: 1, scope: !61)
!68 = distinct !DISubprogram(name: "MAYALIAS", scope: !2, file: !2, line: 12, type: !52, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !54)
!69 = !DILocalVariable(name: "p", arg: 1, scope: !68, file: !2, line: 12, type: !22)
!70 = !DILocation(line: 12, column: 21, scope: !68)
!71 = !DILocalVariable(name: "q", arg: 2, scope: !68, file: !2, line: 12, type: !22)
!72 = !DILocation(line: 12, column: 30, scope: !68)
!73 = !DILocation(line: 13, column: 3, scope: !68)
!74 = !DILocation(line: 14, column: 1, scope: !68)
!75 = distinct !DISubprogram(name: "NOALIAS", scope: !2, file: !2, line: 16, type: !52, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !54)
!76 = !DILocalVariable(name: "p", arg: 1, scope: !75, file: !2, line: 16, type: !22)
!77 = !DILocation(line: 16, column: 20, scope: !75)
!78 = !DILocalVariable(name: "q", arg: 2, scope: !75, file: !2, line: 16, type: !22)
!79 = !DILocation(line: 16, column: 29, scope: !75)
!80 = !DILocation(line: 17, column: 3, scope: !75)
!81 = !DILocation(line: 18, column: 1, scope: !75)
!82 = distinct !DISubprogram(name: "EXPECTEDFAIL_MAYALIAS", scope: !2, file: !2, line: 20, type: !52, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !54)
!83 = !DILocalVariable(name: "p", arg: 1, scope: !82, file: !2, line: 20, type: !22)
!84 = !DILocation(line: 20, column: 34, scope: !82)
!85 = !DILocalVariable(name: "q", arg: 2, scope: !82, file: !2, line: 20, type: !22)
!86 = !DILocation(line: 20, column: 43, scope: !82)
!87 = !DILocation(line: 21, column: 3, scope: !82)
!88 = !DILocation(line: 22, column: 1, scope: !82)
!89 = distinct !DISubprogram(name: "EXPECTEDFAIL_NOALIAS", scope: !2, file: !2, line: 24, type: !52, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !54)
!90 = !DILocalVariable(name: "p", arg: 1, scope: !89, file: !2, line: 24, type: !22)
!91 = !DILocation(line: 24, column: 33, scope: !89)
!92 = !DILocalVariable(name: "q", arg: 2, scope: !89, file: !2, line: 24, type: !22)
!93 = !DILocation(line: 24, column: 42, scope: !89)
!94 = !DILocation(line: 25, column: 3, scope: !89)
!95 = !DILocation(line: 26, column: 1, scope: !89)
